In [7]:
import pandas as pd
import math
yazilimcilar = {"Deneyim":[1,3,5,4,8],"Kazanç":[15,22,25,23,30]}
df=pd.DataFrame(yazilimcilar)

In [10]:
df.index=["Hasan","Ege","Yunus","Mehmet","Kazım"]

In [11]:
df

        Deneyim  Kazanç
Hasan         1      15
Ege           3      22
Yunus         5      25
Mehmet        4      23
Kazım         8      30

In [14]:
df.Kazanç-df.Kazanç.mean()

Hasan    -8.0
Ege      -1.0
Yunus     2.0
Mehmet    0.0
Kazım     7.0
Name: Kazanç, dtype: float64

In [18]:
(df.Kazanç-df.Kazanç.mean()).pow(2).sum()

118.0

In [19]:
filt=(df.Deneyim>3)

In [24]:
df1=df[filt]
df1

        Deneyim  Kazanç
Yunus         5      25
Mehmet        4      23
Kazım         8      30

In [25]:
df2=df[~filt]
df2

       Deneyim  Kazanç
Hasan        1      15
Ege          3      22

In [27]:
df1.Kazanç.mean()

26.0

In [28]:
df2.Kazanç.mean()

18.5

In [29]:
print(df1.Kazanç-df1.Kazanç.mean())

Yunus    -1.0
Mehmet   -3.0
Kazım     4.0
Name: Kazanç, dtype: float64

In [30]:
print(df2.Kazanç-df2.Kazanç.mean())

Hasan   -3.5
Ege      3.5
Name: Kazanç, dtype: float64

In [31]:
(df1.Kazanç-df1.Kazanç.mean()).pow(2).sum()

26.0

In [32]:
(df2.Kazanç-df2.Kazanç.mean()).pow(2).sum()

24.5